[{"year":"2015", "title":"Atual: Integrando Hiper-Heurísticas, Multi-Exames e Modelos Gráficos Probabilísticos em Algoritmos", "text":"Atualmente, a indústria enfrenta demandas por qualidade superior, baixo custo, maior segurança, entre outras. Estas demandas só podem ser satisfeita através da concepção de produtos e processos que visam alcançar todos estes objetivos de desempenho. Os Algoritmos Bioinspirados Multiobjetivo(ABMs) são alternativas poderosas para ajudar a enfrentar estes problemas. Este projeto aborda pesquisa básica e aplicada na área da Computação Bioinspirada continuando as linhas de investigação da proponente: ABMs para resolver Problemas com Muitos Objetivos e Engenharia de Software baseada em Busca (ESB). Três linhas de pesquisa que presentam potencial são focadas no projeto de ABMs : Hiper- heurísticas (HH) que permite automatizar e dinamicamente escolher componentes dos algoritmos, Hibridização de ABMs com Modelos Gráficos Probabilísticos (MGP) e a integração de HH, MGP e multi-enxames. Além disso, para ESB serão adaptadas extensões de ABMs. A Engenharia de Software possui várias atividades que podem ser beneficiadas com o uso destas técnicas e por outro lado apresenta diversos desafios para estes algoritmos. A execução do projeto compreende um conjunto de fases tais como, revisão de trabalhos da literatura, projeto, implementação e avaliação de algoritmos. Espera-se contribuir para o estado da arte na áreas relacionadas em três direções principais: estudos teóricos, estudos empíricos e implementação de algoritmos."},
{"year":"2014", "title":"Atual: Hiper-Heurísticas para Algoritmos Bioinspirados Multiobjetivos e sua Aplicação em Engenharia de Software", "text":"Atualmente, a indústria enfrenta múltiplas demandas por qualidade superior, baixo custo, maior segurança, entre outras. A vantagem competitiva só pode ser estabelecida através da concepção de produtos e processos que respondam por muitos destes objetivos de desempenho. Portanto, nestes problemas muitos objetivos precisam ser tratados simultaneamente. Otimização de Muitos Objetivos Página 1 de 5 (OMOs) consiste na otimização de problemas com muitos objetivos, isto é, Problemas Multiobjetivos (PM) com elevado número de objetivos conflitantes, geralmente mais de quatro. Em problemas como esses, os Algoritmos Bioinspirados (ABs), entre eles os Algoritmos Evolucionários Multiobjetivo (AEMs) se tornam pouco efetivos, entregando como resultado uma aproximação da Frente de Pareto (FP) que possui pouca convergência para a verdadeira FP e pouca diversidade nas soluções. OMOs é uma área nova, ainda pouco explorada, que tem como objetivo propor novos métodos para reduzir esta deterioração. Entre os ABs que podem ser destacados pelos seus bons resultados em PM estão àqueles baseados em Enxame de Partículas Multiobjetivo (Multi-Objective Particle Swarm Optimization, MOPSO). Assim, motivado por este campo de investigação, este trabalho tem por objetivo propor novos métodos para reduzir a deterioração na busca dos MOPSOs quando aplicados a problemas com muitos objetivos, obtendo uma melhor convergência e diversidade."}]