[
{"tipo":"atual", "year":"2017", "title":"Atual: Programação Genética: Criando algoritmos genéricos para resolver problemas combinatórios", "text":"Projetar algoritmos eficazes para resolver problemas computacionais é uma tarefa difícil e demorada. A metodologia padrão para a concepção de tais algoritmos é ``top-down''. Esse processo decompõe o problema em um ou mais componentes e, eventualmente, identifica operadores específicos que os algoritmos precisam usar para resolver um dado problema. Recentemente, um novo conceito está sendo explorado, fundamentado na ideia de que os programas são entidades complexas e seus comportamentos podem ser analisados mais profundamente no processo evolutivo tornando a síntese de programas mais eficaz. Potencialmente, diferentes informações extraídas durante a execução do programa podem ser aproveitadas para fazer a síntese de programas mais escaláveis. Neste projeto deseja-se reconhecer os blocos que compõem um bom programa, para isto técnicas de aprendizado de máquina podem ser utilizadas, com o objetivo de melhorar o projeto de programas em abordagens como a Programação Genética. Trabalhos tem aplicado programação genética com sucesso para a geração de algoritmos com resultados competitivos com a literatura. A execução do projeto compreende um conjunto de fases tais como, revisão de trabalhos da literatura, projeto, implementação e avaliação de algoritmos."},
{"tipo":"atual", "year":"2017", "title":"Atual: Abordagem de representação contextual baseada em conjunto de agrupamentos", "text":"A era digital é caracterizada pelo advento principalmente da internet que tem contribuído com a necessidade de processar e converter grande quantidade de textos em conhecimento. A internet popularizou o uso de e-mails e redes sociais e também auxiliou a expansão de enumeras atividades humanas tais como: médicas, econômicas e jurídicas. Assim também tem crescido o interesse pela análise automática de textos através de modelos de aprendizagem de máquina. Todas as atividades de processamento e análise de texto pressupõem a existência de um modelo computacional capaz de converter o texto escrito em algo inteligível para o computador, uma representação abstrata de texto. A preocupação em construir uma representação de texto refinada é comum por que impacta diretamente nos modelos de aprendizagem de máquina. Este trabalho propõe-se estudar, implementar e avaliar diferentes formas de refinar um modelo de representação de texto utilizando os conceitos de agrupamentos. Os textos são modelados através de grafos heterogêneos, cujos nós podem representar documentos ou palavras e a relação entre eles é dada por uma análise estendida de contexto entre os elementos. Experimentos preliminares indicam que a abordagem baseada em contexto tem relevância para a pesquisa em processamento de linguagem natural à medida que consegue gerar relacionamentos de documentos e palavras que não estão presentes nos mesmos, agregando conceitos externos à representação."},
{"tipo":"atual", "year":"2015", "title":"Atual: Integrando Hiper-Heurísticas, Multi-Exames e Modelos Gráficos Probabilísticos em Algoritmos", "text":"Atualmente, a indústria enfrenta demandas por qualidade superior, baixo custo, maior segurança, entre outras. Estas demandas só podem ser satisfeita através da concepção de produtos e processos que visam alcançar todos estes objetivos de desempenho. Os Algoritmos Bioinspirados Multiobjetivo(ABMs) são alternativas poderosas para ajudar a enfrentar estes problemas. Este projeto aborda pesquisa básica e aplicada na área da Computação Bioinspirada continuando as linhas de investigação da proponente: ABMs para resolver Problemas com Muitos Objetivos e Engenharia de Software baseada em Busca (ESB). Três linhas de pesquisa que presentam potencial são focadas no projeto de ABMs : Hiper- heurísticas (HH) que permite automatizar e dinamicamente escolher componentes dos algoritmos, Hibridização de ABMs com Modelos Gráficos Probabilísticos (MGP) e a integração de HH, MGP e multi-enxames. Além disso, para ESB serão adaptadas extensões de ABMs. A Engenharia de Software possui várias atividades que podem ser beneficiadas com o uso destas técnicas e por outro lado apresenta diversos desafios para estes algoritmos. A execução do projeto compreende um conjunto de fases tais como, revisão de trabalhos da literatura, projeto, implementação e avaliação de algoritmos. Espera-se contribuir para o estado da arte na áreas relacionadas em três direções principais: estudos teóricos, estudos empíricos e implementação de algoritmos."},
{"tipo":"atual", "year":"2014", "title":"Atual: Hiper-Heurísticas para Algoritmos Bioinspirados Multiobjetivos e sua Aplicação em Engenharia de Software", "text":"Atualmente, a indústria enfrenta múltiplas demandas por qualidade superior, baixo custo, maior segurança, entre outras. A vantagem competitiva só pode ser estabelecida através da concepção de produtos e processos que respondam por muitos destes objetivos de desempenho. Portanto, nestes problemas muitos objetivos precisam ser tratados simultaneamente. Otimização de Muitos Objetivos Página 1 de 5 (OMOs) consiste na otimização de problemas com muitos objetivos, isto é, Problemas Multiobjetivos (PM) com elevado número de objetivos conflitantes, geralmente mais de quatro. Em problemas como esses, os Algoritmos Bioinspirados (ABs), entre eles os Algoritmos Evolucionários Multiobjetivo (AEMs) se tornam pouco efetivos, entregando como resultado uma aproximação da Frente de Pareto (FP) que possui pouca convergência para a verdadeira FP e pouca diversidade nas soluções. OMOs é uma área nova, ainda pouco explorada, que tem como objetivo propor novos métodos para reduzir esta deterioração. Entre os ABs que podem ser destacados pelos seus bons resultados em PM estão àqueles baseados em Enxame de Partículas Multiobjetivo (Multi-Objective Particle Swarm Optimization, MOPSO). Assim, motivado por este campo de investigação, este trabalho tem por objetivo propor novos métodos para reduzir a deterioração na busca dos MOPSOs quando aplicados a problemas com muitos objetivos, obtendo uma melhor convergência e diversidade."},
{"tipo":"atual", "year":"2015", "title":"Atual: Métodos multiobjetivo competentes baseados em algoritmos evolutivos e técnicas de modelagem estatística para problemas reais.", "text":"O principal objetivo neste projeto é o desenvolvimento de resultados metodológicos e teóricos para a solução genérica de problemas multiobjetivo complexos (PMO) com métodos baseados em algoritmos evolutivos e modelos probabilísticos gráficos. Para avançar o estado-da-arte para métodos para PMOs nós planejamos a solução das seguintes questões: 1) Concepção de algoritmos evolutivos multiobjetivo competentes (Comp-MOEAs) que imcorporam modelagem probabilística. 2) Aplicação dos Comp-MOEAs para análise de registros do cérebro humano com aplicação do estudo de doenças neurológicas e interfaces cérebro-computador. 3) Desenvolvimento de um modelo teórico para análise de Comp-MOEAs baseados na teoria da genética quantitativa. 4) Análise em rede de modelos probabilísticos aprendidos por Comp-MOEAs com objetivo de extração de conhecimento. 5) Implementação de plataformas de software para Comp-MOEAs em Matblab e Python para introduzir seu uso em aplicações de pesquisa, ensino e industriais."},
{"tipo":"past", "year":"2013-2016", "title":"Algoritmos Multiobjetivos Bioinspirados: Novas Estratégias e Aplicações em Engenharia de Software.", "text":"Este projeto foca pesquisa básica e aplicada na área da Computação Bioinspirada. A pesquisa básica enfoca um tema que atualmente representa um desafio: novos métodos para reduzir a deterioração na busca dos algoritmos baseados em Enxame de Partículas Multiobjetivo (Multi-Objective Particle Swarm Optimization, MOPSO) quando aplicados a problemas com muitos objetivos, melhorando a convergência e diversidade. O objetivo principal deste projeto é explorar as características singulares do MOPSO a fim de propor as novas abordagens, alguns temas como a seleção do líder, multi-enxames, novos métodos para armazenar os líderes no arquivo externo, serão focados. O trabalho também enfatiza a aplicação dos algoritmos multiobjetivos bioinspirados na área Engenharia de Software (ES), auxiliando no desenvolvimento e manutenção de Softwares. A execução do projeto compreende um conjunto de fases tais como, revisão de trabalhos da literatura, projeto, implementação e avaliação de algoritmos. Espera-se contribuir para o estado da arte na área relacionada em três direções principais: estudos teóricos, estudos empíricos e implementação de algoritmos."},
{"tipo":"past", "year":"2010-2013", "title":"Novas Abordagens em Algoritmos Bioinspirados e Aplicações.", "text":"A Computação Bioinspirada estuda técnicas de computação inspiradas na Biologia e desenvolve algoritmos e ferramentas, baseado em processos naturais ou sociais, para a resolução de problemas. Este projeto foca pesquisa básica e aplicada na área da Computação Bioinspirada. A pesquisa básica enfoca um tema que atualmente representa um desafio: o projeto de algoritmos competentes baseados no aprendizado de modelos da população. O trabalho também enfatiza a aplicação dos algoritmos bioinspirados na área de aprendizado de regras (Mineração de Dados, MD), com o objetivo de propor novas abordagens para a realização dessa atividade, especificamente, deseja-se explorar características multiobjetivo. O trabalho também dá ênfase à aplicação dos algoritmos bioinspirados na área de Engenharia de Software (ES), auxiliando no desenvolvimento e manutenção de Softwares. A execução do projeto compreende um conjunto de fases tais como, revisão de trabalhos da literatura, projeto, implementação e avaliação de algoritmos. Espera-se contribuir para o estado da arte na área relacionada em três direções principais: estudos teóricos, estudos empíricos e implementação de algoritmos."},
{"tipo":"past", "year":"2008-2010", "title":"Um Algoritmo Evolutivo Multiobjetivo na Mineração de Repositórios de Softwares.", "text":"Atualmente, os repositórios de softwares são usados para ajudar no gerenciamento do progresso do software. Devido ao enorme volume de informações existentes nas mesmas, os desenvolvedores de software estão percebendo o potencial benéfico das técnicas de Mineração de Dados (MD). A idéia subjacente em MD é a busca e identificação de padrões em dados, para a sua utilização, a posteriori, na tomada de decisões. O problema de identificação de padrões em dados é um problema de otimização Multicritério, pois se por um lado deseja-se obter padrões precisos, por outro lado, tais padrões devem ser genéricos. Neste contexto, este projeto tem como foco o estudo e desenvolvimento de algoritmos Evolutivos Multiobjetivos para o aprendizado de regras de auxilio ao desenvolvimento e manutenção de Softwares. O projeto abordara tanto pesquisas básicas quanto aspectos práticos e aplicações a problemas reais. A pesquisa básica tem como enfoque temas que atualmente representam desafios, tais como a adaptação dos algoritmos evolutivos a problemas Multiobjetivos./Multicritério. O trabalho também dá ênfase à aplicação de Mineração de Dados a área de Engenharia de Software (ES), com objetivo de propor novas abordagens para a realização dessa atividade desenvolvendo uma ferramenta de mineração de repositórios de software. O projeto, dadas as suas características, contara com a colaboração de professores de diferentes Universidades com pesquisas na área de Meta-heurísticas, Mineração de Dados e Engenharia de Software. As principais metas do projeto são: 1) contribuição para o estado da arte em MD e ES, pois o algoritmo e ferramenta representam uma novidade para as áreas; 2) fortalecimento do grupo de pesquisadores envolvidos, destacando sua importância regional e nacional, pois a área é recente e tem sido pouco explorada no Brasil; 3) formação de recursos humanos; 4) disseminação do conhecimento; 5) transferência de tecnologia, devido ao crescente interesse nas áreas de aplicação do projeto."},
{"tipo":"past", "year":"2008-2010", "title":"Nuvem de Partículas Multiobjetivo no Aprendizado de Regras de Predição de Defeitos em Softwares.", "text":"A atividade de teste de software consume tempo e recursos. Os modelos de predição de defeitos em software podem ser usados para identificar automaticamente as classes com defeitos. Desta forma, estes modelos podem reduzir a duração da atividade de teste, assim como os custos de recursos e infra-estrutura. Esta proposta foca um novo modelo de predição de defeitos com o objetivo de aperfeiçoar a atividade de teste. As diferentes métricas de projeto Orientado Objeto (OO), como as métricas propostas por Chidamber e por Kemerer (CK-metric suite), serão analisadas como possíveis variáveis independentes para o modelo induzido por um algoritmo baseado em Nuvem de Partículas Multiobjetivos (MOPSO). A proposta contribuirá para o estado da arte em mineração de dados (MD) e em Engenharia de Software (ES). Na área de MD, o algoritmo focará alguns aspectos considerados desafiadores para a área como: obter diretamente um conjunto de regras com propriedades específicas mediante meta-heurísticas multiobjetivos, a capacidade de tratar atributos discretos e reais; e trabalhar com bases de dados desbalanceadas. Características freqüentemente encontradas nos repositórios de softwares. Na área de ES a contribuição é o novo modelo eficiente, um sistema de classificação de defeitos em classes que utiliza métricas OO."},
{"tipo":"past", "year":"2007-2008", "title":"Otimização por Nuvem de Partículas e Mineração de Dados.", "text":"O termo 'Vida Artificial' é usado para descrever pesquisas/técnicas em sistemas que possuem algumas propriedades análogas as da vida real, dentre as quais destaca-se a Otimização por Nuvem de Partículas (ONP). A ONP é uma técnica baseada em população de indivíduos (soluções), desenvolvida por James Kennedy e Russell Eberhart, em (1995) através da observação do comportamento de pássaros em revoadas, modelado pelo biólogo Frank Heppner. A ONP tem sido aplicada com sucesso em muitas áreas de otimização como, por exemplo: de funções; no treinamento em redes neurais artificiais; no controle de sistemas nebulosos; dentre outros. Por outro lado, atualmente está-se enfrentando um novo paradoxo, o acúmulo de dados /informações nas organizações. A necessidade de automatizar o processo de extração de conhecimento a partir destes dados, torna-se um procedimento cada vez mais importante. A idéia subjacente em Mineração de Dados (Data Mining), Freitas, 2000, é a busca e identificação de padrões em dados, para a sua utilização, a posteriori, na tomada de decisões. Neste contexto, este projeto tem como foco o estudo e desenvolvimento de algoritmos baseados na técnica de ONP, abordando tanto pesquisas básicas quanto aspectos práticos e aplicações a problemas reais. A pesquisa básica tem como enfoque temas que atualmente representam desafios, tais como sua adaptação a problemas Multiobjetivos./Multicritério. O trabalho também dá ênfase a aplicação de ONP à Mineração de Dados, com objetivo de propor novas abordagens para a realização dessa atividade. O problema de identificação de padrões em dados é um problema de otimização Multicritério, pois se por um lado deseja-se obter padrões precisos, por outro lado, tais padrões devem ser genéricos."},
{"tipo":"past", "year":"2006-2008", "title":"Um algoritmo evolutivo baseado no aprendizado em ambientes dinâmicos.", "text":"Algoritmos de Computação Evolutiva (CE) têm sido aplicados com sucesso a problemas de busca e otimização das diversas áreas de aplicação e com diversos níveis de dificuldade. Pesquisas atuais focam na obtenção de algoritmos que sejam considerados competentes, no sentido de serem capazes de resolver problemas difíceis. Estes algoritmos são capazes de manter um nível adequado de diversidade na população, além de aprender sobre a estrutura do problema ao qual são aplicados, capturando interações importantes e mantendo-as ao longo do processo evolutivo. Para capturar estas informações sobre o problema e assim guiar o processo evolutivo, cada algoritmo adota um mecanismo de aprendizado; podemos citar o aprendizado de redes bayesianas, a indução de classificadores e o aprendizado de regras simbólicas como sendo os mecanismos adotados por algoritmos de CE. Entretanto, o custo computacional do processo de aprendizado escolhido é um fator limitante de alguns algoritmos, já que esta etapa é repetida a cada nova geração. Por outro lado, outros algoritmos são mais baratos computacionalmente, mas apresentam menor capacidade de prospecção do espaço de busca, exigindo a adoção de estratégias híbridas. Estes fatores evidenciam que ainda existe espaço para novas propostas em Computação Evolutiva. Neste projeto, propomos uma nova abordagem para a CE, em torno da hipótese de que o processo evolutivo seja considerado como um ambiente dinâmico, não-estacionário, e a Computação Evolutiva deva, conseqüentemente, ser guiada por técnicas reconhecidamente adequadas ao aprendizado em ambientes dinâmicos, tais como o aprendizado incremental e os ensembles de classificadores. Para realizar o trabalho proposto serão realizados os seguintes passos: levantamento do estado da arte das áreas de CE e de aprendizado em ambientes dinâmicos, escolha de técnicas de aprendizado incremental e ensembles e adequá-las ao problema, desenvolvimento e implementação do novo algoritmo e realização de experimentos."},
{"tipo":"past", "year":"2005-2007", "title":"Boosting e Teoria da Informação em Estratégia Evolucionária para a Indução de Classificadores.", "text":"É incontestável o crescimento no volume de informações em todas as áreas de conhecimento e a utilização de ferramentas que auxiliem na análise das informações. Tais ferramentas surgem de áreas como mineração de dados (Data Mining) e aprendizado de máquina (Machine Learning). Embora a pesquisa nestas áreas tenha se intensificado, existe muito a se desenvolver. O objetivo deste projeto é contribuir com a descoberta de leis empíricas a partir dos exemplos e de conhecimento do domínio. O projeto situa-se no domínio de mineração de dados e aprendizado de máquina. Mais especificamente, o objetivo do trabalho é a utilização e o desenvolvimento de métodos de aprendizado de máquina e de otimização por algoritmos de evolução para a tarefa de mineração de dados chamada classificação."}
]